In [106]:
import numpy as np
import pandas as pd
from sklearn.model_selection import train_test_split
import matplotlib.pyplot as plt

In [107]:
data = pd.read_csv('train.csv')

In [108]:
data.head()

,Id,age,years_of_experience,lesson_price,qualification,physics,chemistry,biology,english,geography,history,mean_exam_points,choose
0,0,35.0,0.0,2150.0,2.0,0.0,0.0,0.0,0.0,0.0,0.0,74.0,0
1,1,52.0,2.0,1250.0,2.0,1.0,0.0,1.0,0.0,0.0,1.0,57.0,1
2,2,29.0,3.0,1750.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,66.0,0
3,3,33.0,3.0,1050.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,66.0,1
4,4,46.0,3.0,2250.0,2.0,1.0,0.0,0.0,0.0,0.0,0.0,73.0,0

In [109]:
df = data.copy()

In [110]:
df.describe()

,Id,age,years_of_experience,lesson_price,qualification,physics,chemistry,biology,english,geography,history,mean_exam_points,choose
count,10000.00000,10000.000000,10000.000000,10000.000000,10000.000000,10000.00000,10000.000000,10000.000000,10000.000000,10000.00000,10000.000000,10000.000000,10000.000000
mean,4999.50000,45.800900,1.974800,1702.440000,1.724300,0.37060,0.121500,0.117200,0.059100,0.02770,0.018000,64.435200,0.110900
std,2886.89568,8.030274,1.766883,523.789062,0.798845,0.48299,0.326724,0.321675,0.235824,0.16412,0.132958,13.595024,0.314024
min,0.00000,23.000000,0.000000,200.000000,1.000000,0.00000,0.000000,0.000000,0.000000,0.00000,0.000000,33.000000,0.000000
25%,2499.75000,40.000000,0.000000,1300.000000,1.000000,0.00000,0.000000,0.000000,0.000000,0.00000,0.000000,55.000000,0.000000
50%,4999.50000,46.000000,2.000000,1550.000000,2.000000,0.00000,0.000000,0.000000,0.000000,0.00000,0.000000,63.000000,0.000000
75%,7499.25000,51.000000,3.000000,2150.000000,2.000000,1.00000,0.000000,0.000000,0.000000,0.00000,0.000000,74.000000,0.000000
max,9999.00000,68.000000,9.000000,3950.000000,4.000000,1.00000,1.000000,1.000000,1.000000,1.00000,1.000000,100.000000,1.000000

In [111]:
df = df.drop('Id', axis=1)

In [112]:
df.head()

,age,years_of_experience,lesson_price,qualification,physics,chemistry,biology,english,geography,history,mean_exam_points,choose
0,35.0,0.0,2150.0,2.0,0.0,0.0,0.0,0.0,0.0,0.0,74.0,0
1,52.0,2.0,1250.0,2.0,1.0,0.0,1.0,0.0,0.0,1.0,57.0,1
2,29.0,3.0,1750.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,66.0,0
3,33.0,3.0,1050.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,66.0,1
4,46.0,3.0,2250.0,2.0,1.0,0.0,0.0,0.0,0.0,0.0,73.0,0

In [113]:
categorical_features = ['physics', 'chemistry', 'biology', 'english', 'geography', 'history']

In [114]:
df_without_category = df.drop(categorical_features, axis=1)

In [115]:
df_without_category.head()

,age,years_of_experience,lesson_price,qualification,mean_exam_points,choose
0,35.0,0.0,2150.0,2.0,74.0,0
1,52.0,2.0,1250.0,2.0,57.0,1
2,29.0,3.0,1750.0,1.0,66.0,0
3,33.0,3.0,1050.0,1.0,66.0,1
4,46.0,3.0,2250.0,2.0,73.0,0

In [116]:
target = df['choose']

In [117]:
df_without_category = df_without_category.drop('choose', axis=1)

In [118]:
X = np.array(df_without_category)

In [119]:
y = np.array(target)
y = y.reshape((-1,1))

In [120]:
X_categorical = np.array(df[categorical_features])

In [122]:
X_categorical.shape

(10000, 6)

In [91]:
from Models.Models import PolynomialFeatures, StandardScaler, LogisticRegression

In [94]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.3, random_state=42)

In [95]:
poly = PolynomialFeatures(degree=2)

In [96]:
X_poly = poly.fit_transform(X_train)

In [97]:
scaler = StandardScaler()

In [98]:
X_scaled = scaler.fit_transform(X_poly)

In [99]:
log_reg = LogisticRegression(max_iter=5000,random_state=1)

In [101]:
%%time
log_reg.fit(X_scaled, y_train)

Wall time: 6.98 ms

In [102]:
y_pred = log_reg.predict(X_scaled)

In [103]:
def accuracy_metric(actual, predicted):
    correct = 0
    for i in range(len(actual)):
        if actual[i] == predicted[i]:
            correct += 1
    return correct / float(len(actual)) * 100.0

In [105]:
accuracy_metric(y_train, y_pred)

89.08571428571429

In [143]:
LogisticRegression(l=1)

TypeError: __init__() got an unexpected keyword argument 'l'